АлогистикТест2/src/Documents/алк_РасходнаяНакладная_Отходы/алк_РасходнаяНакладная_Отходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РасходнаяНакладная_Отходы</name>
  <comment>Расходная накладная по отходам (щепа, кора, опилки), реализуемым по объему и весу</comment>
  <registerRecords>AccumulationRegister.алк_Отходы</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.алк_ВидыДокументаРН_Отходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительнаяАналитика</name>
      <type>
        <types>CatalogRef.алк_АналитикаОборотаОтходов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидыДокументаРН_Отходы/алк_ВидыДокументаРН_Отходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДокументаРН_Отходы</name>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеКотельной</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеПрочее</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПоддонов</name>
  </enumValues>
  <enumValues>
    <name>Утилизация</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_АналитикаЩепа/алк_АналитикаЩепа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_АналитикаЩепа</name>
  <enumValues>
    <name>Лущение</name>
  </enumValues>
  <enumValues>
    <name>Ребросклей</name>
  </enumValues>
  <enumValues>
    <name>ЦЛП</name>
  </enumValues>
  <enumValues>
    <name>НаПроизводствоВозвратных</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПоддонов</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеПрочее</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеКотельной</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Утилизация</name>
  </enumValues>
  <enumValues>
    <name>Окорка</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПеремещениеЛесопродукции/алк_ПеремещениеЛесопродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеЛесопродукции</name>
  <comment>Перемещение лесопродукции (круглые ЛМ и пиломатериала штучно) по различным направлениям с указанием участка отправителя</comment>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиБиржа</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.алк_ВидыДокументовПеремещенияЛесопродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускатьМинус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_РасходнаяНакладная_Отходы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРНОтходы, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РасходнаяНакладная_ОтходыЗапасы.Номенклатура,
		|	алк_РасходнаяНакладная_ОтходыЗапасы.Характеристика,
		|	алк_РасходнаяНакладная_ОтходыЗапасы.Вес,
		|	алк_РасходнаяНакладная_ОтходыЗапасы.Объем,
		|	&Период,
		|	&ВидДвижения,
		|	алк_РасходнаяНакладная_ОтходыЗапасы.Ссылка.ДатаСмены,
		|	алк_РасходнаяНакладная_ОтходыЗапасы.Ссылка.Смена,
		|	ВЫБОР
		|		КОГДА алк_РасходнаяНакладная_ОтходыЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументаРН_Отходы.Реализация)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_АналитикаЩепа.Реализация)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА алк_РасходнаяНакладная_ОтходыЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументаРН_Отходы.ПроизводствоПоддонов)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_АналитикаЩепа.ПроизводствоПоддонов)
		|				ИНАЧЕ ВЫБОР
		|						КОГДА алк_РасходнаяНакладная_ОтходыЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументаРН_Отходы.ПотреблениеКотельной)
		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_АналитикаЩепа.ПотреблениеКотельной)
		|						ИНАЧЕ ВЫБОР
		|								КОГДА алк_РасходнаяНакладная_ОтходыЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументаРН_Отходы.ПотреблениеПрочее)
		|									ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_АналитикаЩепа.ПотреблениеПрочее)
		|								ИНАЧЕ ВЫБОР
		|										КОГДА алк_РасходнаяНакладная_ОтходыЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументаРН_Отходы.Утилизация)
		|											ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_АналитикаЩепа.Утилизация)
		|										ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.алк_АналитикаЩепа.ПустаяСсылка)
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Аналитика,
		|	алк_РасходнаяНакладная_ОтходыЗапасы.ДополнительнаяАналитика
		|ИЗ
		|	Документ.алк_РасходнаяНакладная_Отходы.Запасы КАК алк_РасходнаяНакладная_ОтходыЗапасы
		|ГДЕ
		|	алк_РасходнаяНакладная_ОтходыЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаРНОтходы.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРНОтходы.Ссылка);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
		//Запрос.УстановитьПараметр("Номенклатура", РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Щепа));
		
		МассивРезультатов = Запрос.ВыполнитьПакет();	
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтходы", МассивРезультатов[0].Выгрузить());
		
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
		
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасходнаяНакладная") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РасходнаяНакладная", "Расходная накладная", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РасходнаяНакладная"));
			
		КонецЕсли;
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "РасходнаяНакладная" Тогда
				
				СформироватьРасходнуюНакладную(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "РасходнаяНакладная";
		КомандаПечати.Представление = НСтр("ru = 'Расходная накладная'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;	
		
	КонецПроцедуры
	
	// Процедура формирования Железнодорожной спецификации для пиломатериалов
	//
	Процедура СформироватьРасходнуюНакладную(ТабличныйДокумент, ТекущийДокумент)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Ссылка КАК Ссылка,
		|	алк_ПеремещениеЛесопродукцииЗапасы.НомерСтроки,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Номенклатура,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Характеристика,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Количество КАК Количество,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Объем КАК Объем,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Номер КАК Номер,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Дата КАК ДатаДокумента,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.ВидДокумента) КАК ВидОперации,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация.Префикс КАК Префикс,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница,
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка.Организация
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции.Запасы КАК алк_ПеремещениеЛесопродукцииЗапасы
		|ГДЕ
		|	алк_ПеремещениеЛесопродукцииЗапасы.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Объем)
		|ПО
		|	Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.Ссылка);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ПеремещениеЛесопродукции.ПФ_MXL_Накладная");
		
		РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
		
		ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСсылка.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ВыборкаСсылка.ДатаДокумента, ВыборкаСсылка.Номер, ВыборкаСсылка.Префикс);
			
			ОбластьМакета.Параметры.ТекстЗаголовка = "Расходная накладная № "
			+ НомерДокумента
			+ " от "
			+ Формат(ВыборкаСсылка.ДатаДокумента, "ДЛФ=DD");
			
			ОбластьМакета.Параметры.ВидОперации = ВыборкаСсылка.ВидОперации;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
			
			СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ВыборкаСсылка.Организация, ВыборкаСсылка.ДатаДокумента, ,);
			ОбластьМакета.Параметры.ПредставлениеПоставщика = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ФактическийАдрес") +
			", " + ВыборкаСсылка.СтруктурнаяЕдиница;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
			ОбластьМакета.Параметры.ПредставлениеПолучателя = "";
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ВыборкаЗапасы = ВыборкаСсылка.Выбрать();
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			
			Количество = 0;
			
			Пока ВыборкаЗапасы.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаЗапасы);
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Количество	= Количество + 1;
				
			КонецЦикла; 
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСсылка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогиПрописью");
			ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований "
			+ Строка(Количество) + ", общее Количество " + Строка(ВыборкаСсылка.Количество) + " (" + УправлениеНебольшойФирмойСервер.КоличествоПрописью(ВыборкаСсылка.Количество) 
			+ "), общий Объем " + Строка(ВыборкаСсылка.Объем) + " (" + УправлениеНебольшойФирмойСервер.КоличествоПрописью(ВыборкаСсылка.Объем) + ")";
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПодписьАкта");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла; 
		
		
		
		
		
	КонецПроцедуры // СформироватьРасходнуюНакладную
	
	#КонецОбласти
	
	
#КонецЕсли

Процедура Конец()	
КонецПроцедуры
